TestCases/system/rotationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          rotationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Use the same parameters as from the command line
// makeAxialOldMode 1;

// used in old and in new mode
makeAxialAxisPatch movingWall;
makeAxialWedgePatch frontAndBack;

// used only in old mode
makeAxialOffset 0.05;

// used only in new mode
rotationVector (1 0 0);
originVector (0 0.15 0); //offset
// originVector (0 0 0); // origin

wedgeAngle 5;

// revolve option
// 0 = old and default mode, points are projected on wedges
// 1 = points are revolved
revolve 0;


// ************************************************************************* //
